In [12]:
import pandas as pd

In [13]:

# Create a Pandas Series from a list
school_series = pd.Series(high_schools)
school_series

0    Hernandez High School
1     Figueroa High School
2       Wilson High School
3       Wright High School
dtype: object

In [15]:
# A dictionary of high schools

high_school_dicts = [{"School ID" : 0, "school_name" : "Huang High School", "type" : "District"},
                   {"School ID" : 1, "school_name" : "Figueroa High School", "type" : "District"},
                   {"School ID" : 2, "school_name" : "Shelton High School", "type" : "Charter"},
                   {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                   {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [16]:
# Convert the array, or list of dictionaries, to a Data Frame
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [4]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [21]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
for school_type in high_school_types:
    print (school_type)
school_type_df = pd.DataFrame(high_school_types)
school_type_df

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

  High School      Type
0     Griffin  District
1    Figueroa  District
2      Wilson   Charter
3      Wright   Charter

In [22]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School", "Griffin High School"]

type_of_school = ["District", "District", "Charter", "District", "Charter"]

In [24]:
#Initialize a new DataFrame

schools_df = pd.DataFrame()

In [25]:
# Add a list to a new DataFrame

schools_df["School_ID"] = school_id

# Print the DataFrame
schools_df

   School_ID
0          0
1          1
2          2
3          3
4          4

In [26]:
# Add a list to a new DataFrame
schools_df["School_Name"] = school_name

# Print the DataFrame
schools_df

   School_ID            School_Name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [32]:
# Add a list to a new DataFrame
schools_df["type"] = type_of_school

# Print
schools_df

   School_ID            School_Name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [41]:
# Create a dictionary of information on high schools
high_schools_dict = {'School Id' : school_id, 'school_name' : school_name, 
'type' : type_of_school}

high_schools_df = pd.DataFrame(high_schools_dict)
high_schools_df

   School Id            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [42]:
school_df.columns

Index(['School ID', 'school_name', 'type', 'Type'], dtype='object')

In [43]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [44]:
school_df.values

array([[0, 'Huang High School', 'District', 'District'],
       [1, 'Figueroa High School', 'District', 'District'],
       [2, 'Shelton High School', 'Charter', 'Charter'],
       [3, 'Hernandez High School', 'District', 'District'],
       [4, 'Griffin High School', 'Charter', 'Charter']], dtype=object)